{
    "id": "espn",
    "audio": "pkg:/components/audio/espn.mp3",
    "header": {
        "title": "ESPN",
        "subtitle": "2016 - 2018",
        "background": {
            "small": "https://res.cloudinary.com/dwkr3rvtr/image/upload/w_1440,c_limit,dpr_auto,f_auto/espn_dgaqr1",
            "medium": "https://res.cloudinary.com/dwkr3rvtr/image/upload/w_1440,c_limit,dpr_auto,f_auto/espn_dgaqr1",
            "large": "https://res.cloudinary.com/dwkr3rvtr/image/upload/w_2048,c_limit,dpr_auto,f_auto/espn_dgaqr1"
        },
        "backgroundColor": "0xD61E26",
        "info": {
            "color": {
                "primary": "0xFFFFFF",
                "secondary": "0x000000",
                "tertiary": "0xFFFFFF"
            },
            "title": "",
            "description": "Software Engineer - Front End",
            "story": {
                "column1": [
                    {
                        "title": "",
                        "description": "The team I joined at ESPN went through many names, ultimately settling on the Product Engineering team. We were responsible for maintaining multiple consumer facing sites including espn.com, secsports.com, espnfc.us, espncricinfo.com.<br/><br/>This included triaging tickets coming in, making sure they were tagged correctly as minor, major, or critical, and handling them appropriately. If it was a front end issue I would find the problem and fix it. If it ended up being something else, such as an API issue or a mobile app issue I would contact the appropriate team and hand the ticket off. Part of this was also being on an on call rotation.<br/><br/>Being a part of such an important team, one that touches virtually all of ESPN’s products and that acts as a first response to an array of issues was a great experience. I got exposure to different technologies I otherwise wouldn’t have if I was on a more niche team, which was ideal for me early in my career."
                    }
                ],
                "column2": [
                    {
                        "title": "",
                        "description": "In addition to the triage and ticket handling, we also got a chance to work on new projects. One of these was building an internal tool from the ground up, the Issues Tool. This is a dashboard where our editors can create new tickets for bugs, check on their progress, and leave comments. It integrates with the Jira API, so that it is always synced, but it provides a more user friendly interface and autofills some of the ticket fields, so that they are consistent and easier to track. The app was created with React and Redux. It was one of my first experiences with React, definitely my first major project with it.<br/><br/>As ESPN slowly transitioned away from older technology to use more React, the experience I received on that project would prove to be invaluable. One of the last things I got to do, and one in which React was a big part, was that I was able to work with the Watch team on the release of ESPN+. I was responsible for the schedule page and implementing page tracking. Knowing that I had a hand in our biggest product release in years, is something I am very proud of."
                    }
                ]
            }
        },
        "blurbs": [
            {
                "title": "Location",
                "description": "Bristol, CT"
            },
            {
                "title": "ESPN.com",
                "description": "Worked on maintaining ESPN's consumer facing sites using multiple tech stacks - React, Backbone, jQuery, Tea"
            },
            {
                "title": "Internal Tools",
                "description": "Worked with a small team to develop the Issues Tool using React and Redux"
            },
            {
                "title": "ESPN+",
                "description": "Worked with the Watch team on features such as the schedule page and analytics"
            }
        ]
    },
    "content": [
        {
            "type": "showcase",
            "data": {
                "imgPos": "left",
                "images": [
                    {
                        "publicId": "espn_homepage_d8n8xw",
                        "src": "https://res.cloudinary.com/dwkr3rvtr/image/upload/v1590553453/espn_homepage_d8n8xw.png",
                        "alt": "espn.com"
                    },
                    {
                        "publicId": "espnfc_ett0vx",
                        "src": "https://res.cloudinary.com/dwkr3rvtr/image/upload/v1590553395/espnfc_ett0vx.jpg",
                        "alt": "espnfc.us"
                    },
                    {
                        "publicId": "secsports_homepage_glmppv",
                        "src": "https://res.cloudinary.com/dwkr3rvtr/image/upload/v1590553455/secsports_homepage_glmppv.png",
                        "alt": "secsports.com"
                    },
                    {
                        "publicId": "cricinfo_homepage_qy8uhc",
                        "src": "https://res.cloudinary.com/dwkr3rvtr/image/upload/v1590553454/cricinfo_homepage_qy8uhc.png",
                        "alt": "espncricinfo.com"
                    },
                    {
                        "publicId": "espnplus_pqciit",
                        "src": "https://res.cloudinary.com/dwkr3rvtr/image/upload/v1590553395/espnplus_pqciit.png",
                        "alt": "ESPN+"
                    }
                ],
                "title": "",
                "description": "Some of the sites and products I worked on - espn, espnfc, secsports, espncricinfo, and ESPN+"
            }
        }
    ]
}
